{
         "@odata.type":  "#microsoft.graph.androidCompliancePolicy",
         "roleScopeTagIds":  [

                        ],
         "description":  "Base Android OS Compliance Policy",
         "displayName":  "Default Android Compliance Policy",
         "version":  1,
         "passwordRequired":  true,
         "passwordMinimumLength":  6,
         "passwordRequiredType":  "numeric",
         "passwordMinutesOfInactivityBeforeLock":  null,
         "passwordExpirationDays":  null,
         "passwordPreviousPasswordBlockCount":  5,
         "passwordSignInFailureCountBeforeFactoryReset":  null,
         "securityPreventInstallAppsFromUnknownSources":  false,
         "securityDisableUsbDebugging":  false,
         "securityRequireVerifyApps":  false, 
         "deviceThreatProtectionEnabled":  true,
         "deviceThreatProtectionRequiredSecurityLevel":  "low",
         "securityBlockJailbrokenDevices":  true,
         "osMinimumVersion":  null,
         "osMaximumVersion":  null,
         "minAndroidSecurityPatchLevel":  null,
         "storageRequireEncryption":  true,
         "securityRequireSafetyNetAttestationBasicIntegrity":  true,
         "securityRequireSafetyNetAttestationCertifiedDevice":  false,
         "securityRequireGooglePlayServices":  false,
         "securityRequireUpToDateSecurityProviders":  false,
         "securityRequireCompanyPortalAppIntegrity":  true,
         "conditionStatementId":  null,
         "scheduledActionsForRule":[{"ruleName":"PasswordRequired","scheduledActionConfigurations":[{"actionType":"block","gracePeriodHours":0,"notificationTemplateId":""}]}],
         "restrictedApps":  [

                       ]
}
